w7d3/goal_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "a"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, pw)
        user = User.find_by(username: username)