w6d3/art_shares/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"