w11d1/todos-rails/app/controllers/api/todos_controller.rb

  def index
    render json: Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["body", "dhakj"], ["done", false], ["created_at", "2021-02-01 23:15:26.183533"], ["updated_at", "2021-02-01 23:15:26.183533"]]