w7d2/music_app/app/views/bands/show.html.erb

<ul>
    <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]