w6d3-4/art_shares/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
  def destroy
    artwork_share = ArtworkShare.find(params[:id])
    artwork_share.destroy