w6d3-4/art_shares/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "users"."id" = $1  [["id", "1"]]
---
  def index
    render json: Artwork.where(artist_id: params[:user_id]) +
                 Artwork.joins(:shared_viewers).where(users: {id: params[:user_id]})

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorited" = $1 WHERE "artworks"."id" = $2  [["favorited", true], ["id", 1]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["artwork_id", 2], ["viewer_id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorited" = $1 WHERE "artwork_shares"."id" = $2  [["favorited", true], ["id", 4]]
---
  def favorite
    debugger
    artwork = Artwork.find(params[:id])
    if artwork.artist_id == params[:user_id].to_i
      artwork.update!(favorited: true)
      artwork.save
      render json: artwork
    else
      artwork_share = artwork.artwork_shares.find_by(viewer_id: params[:user_id])
      artwork_share.update!(favorited: true)