w6d3-4/art_shares/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
---
    def index
        if params[:user_id]
            comments = Comment.where(author_id: params[:user_id])