w6d3-4/art_shares/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE 'joejoejoe')
---
    def index
        #debugger
        # if params has a :query key -> search for that user
        if params.keys.length > 2
            key = params.keys.reject {|k| k == "controller" || k == "action"}.first
            users = User.where('username LIKE ?', "%#{params[key]}%")
        else
            # otherwise -> return all users
            users = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "cool_name_yep"], ["email", "cool_email_too_yep@yep_more"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "janes_cool_new_email@joe.com"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
        user.update!(user_params)