w6d5/NinetynineCats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "d"], ["updated_at", "2021-01-01 00:48:45.273772"], ["id", 2]]