w7d2/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, pw)
        user = User.find_by(email: email)