w6d3/first_routes/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "cool_name_yep"], ["email", "cool_email_too_yep@yep_more"]]

    def update
        user = User.find(params[:id])
        user.update!(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "janes_cool_new_email@joe.com"], ["id", 2]]