w8d1/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "9VQnEYRq2CSKhMVSJ5gOpw"], ["updated_at", "2021-01-11 18:09:50.051514"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!