w7d2/music_app/app/controllers/albums_controller.rb

  def edit
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # debugger
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "is_live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "newAlbum"], ["year", 2021], ["band_id", 2], ["is_live", true], ["created_at", "2021-01-05 22:36:13.865187"], ["updated_at", "2021-01-05 22:36:13.865187"]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "newtitle"], ["updated_at", "2021-01-05 22:38:50.121049"], ["id", 1]]