w7d2/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Blubber Band"], ["updated_at", "2021-01-05 20:13:55.498504"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])
    if @band.update(band_params)