w7d2/music_app/app/views/albums/edit.html.erb

    <select name="album[band_id]">
      <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"