w7d2/music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
    <select name="album[band_id]">
      <% Band.all.each do |band| %>