w7d2/music_app/app/views/tracks/edit.html.erb

        <select name="track[album_id]">
            <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"