w7d2/music_app/app/views/tracks/new.html.erb

SELECT "albums".* FROM "albums"
---
        <select name="track[album_id]">
            <% Album.all.each do |album| %>